#ifndef BES_PROTOCOL_H
#define BES_PROTOCOL_H
/*
 * Автор: Сырцев Вадим Игоревич,
 * Воропаев Владимир Геннадьевич,
 * Жужликова Екатерина Алексеевна
 * Группа 03ПГ
*/

/* ------------------------------------------------------------
// СПИСОК КОМАНД ОБЩЕНИЯ КЛИЕНТСКОГО ПРИЛОЖЕНИЯ С СЕРВЕРНЫМ
// ------------------------------------------------------------
*/

#define MESSAGE_BODY_KEY "тело_сообщения"


// Общая часть всех ответов
// ------------------------------------------------------------
#define QUERY_TYPE_KEY "тип_запроса"
#define QUERY_RESPONSE_KEY "код_ответа"
// ------------------------------------------------------------

#define REGISTRATION_QUERY "РЕГИСТРАЦИЯ"
// Запрос
// ------------------------------------------------------------
#define USER_FIRST_NAME_KEY "имя"
#define USER_LAST_NAME_KEY "фамилия"
#define USER_EMAIL_KEY "почта"
#define USER_PASSWORD_KEY "пароль"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------

// ------------------------------------------------------------


#define LOGIN_QUERY "ВХОД"
// Запрос
// ------------------------------------------------------------
#define USER_EMAIL_KEY "почта"
#define USER_PASSWORD_KEY "пароль"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------
#define USER_ID_KEY "ид_пользователя"
// ------------------------------------------------------------


#define GET_USERS_LIST_QUERY "СПИСОК_ПОЛЬЗОВАТЕЛЕЙ"
// Запрос
// ------------------------------------------------------------
// Ответ
#define USERS_KEY "пользователи"
// ------------------------------------------------------------

#define GET_CHATS_LIST_QUERY "СПИСОК_ЧАТОВ_ПОЛЬЗОВАТЕЛЯ"
// Запрос
// ------------------------------------------------------------
#define SENDER_ID_KEY "ид_отправителя"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------
#define CHATS_KEY "чаты"
#define CHAT_ID_KEY "ид_чата"
#define CHAT_TITLE_KEY "название"
// ------------------------------------------------------------

#define GET_USERS_IN_CHAT_LIST "СПИСОК_УЧАСТНИКОВ_ЧАТА"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------
#define USERS_KEY "пользователи"
// ------------------------------------------------------------

#define GET_UNREAD_MESSAGES_QUERY "НЕПРОЧИТАННЫЕ_СООБЩЕНИЯ"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
#define LAST_MESSAGE_TIMESTAMP_KEY "временная_метка"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------
#define LIST_OF_UREAD_MESSAGES_KEY "сообщения"
// ------------------------------------------------------------

#define SEND_MESSAGE_QUERY "ОТПРАВИТЬ_СООБЩЕНИЕ"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
#define MESSAGE_BODY_KEY "тело_сообщения"
// ------------------------------------------------------------
// Ответ
#define MESSAGE_SENDING_TIME_KEY "время_отправки"
// ------------------------------------------------------------

#define CREATE_CHAT_QUERY "СОЗДАТЬ_ЧАТ"
// Запрос
// ------------------------------------------------------------
#define CHAT_NAME_KEY "название_чата"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
// ------------------------------------------------------------

#define DELETE_CHAT_QUERY "УДАЛИТЬ_ЧАТ"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------

#define INVITE_TO_CHAT_QUERY "ПРИГЛАСИТЬ_В_ЧАТ"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
#define USER_ID_KEY "ид_пользователя"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------

#define KICK_FROM_CHAT_QUERY "ИСКЛЮЧИТЬ_ИЗ_ЧАТА"
// Запрос
// ------------------------------------------------------------
#define CHAT_ID_KEY "ид_чата"
#define USER_ID_KEY "ид_пользователя"
// ------------------------------------------------------------
// Ответ
// ------------------------------------------------------------

#define SYNCHRONIZATION_QUERY "СИНХРОНИЗАЦИЯ"
// Запрос
// ------------------------------------------------------------

// ------------------------------------------------------------
// Ответ
#define CHATS_KEY "чаты"
#define TIMESTAMP_KEY "временная_метка"
#define MESSAGES_KEY "сообщения"
#define SENDING_MESSAGE_TIMESTAMP "время_отправления"
// ------------------------------------------------------------

#endif // BES_PROTOCOL_H
